[
  {
    "id": 1,
    "name": "Adversary",
    "description": "Upgrade the difficulty of any combat check targeting this character once per rank of Adversary.",
    "activation": "Passive",
    "ranked": true,
    "force": false
  },
  {
    "id": 2,
    "name": "All-Terrain Driver",
    "description": "When piloting a vehicle using the Piloting (Planetary) skill, the character does not suffer the penalties for driving through difficult terrain.",
    "activation": "Passive",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  1 }] }
  },
  {
    "id": 3,
    "name": "Anatomy Lesson",
    "description": "After a successful attack with a personal (non-starship/vehicle) weapon, the character may spend one Destiny Point to add damage equal to his Intellect to one hit of the attack.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  14 }] }
  },
  {
    "id": 4,
    "name": "Armor Master",
    "description": "When wearing armor, the chaaracter increases his total soak value by one.",
    "activation": "Passive",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  13 }] }
  },
  {
    "id": 5,
    "name": "Armor Master (Improved)",
    "description": "When wearing armor with a soak value of two or higher, the character increases his defense by one.",
    "activation": "Passive",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  13 }] }
  },
  {
    "id": 6,
    "name": "Bacta Specialist",
    "description": "Patients under the character’s supervision regain one additional wound per rank of Bacta Specialist each time they recover a wound while recovering in a Bacta Tank or under supervised medical conditions or long-term care.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  14 }] }
  },
  {
    "id": 7,
    "name": "Bad Motivator",
    "description": "Once per game session, the character may take a Bad Motivator action to make a Hard Difficulty Mechanics check. If successful, one device (subject to the GMs approval) spontaneously fails due to the character’s involvement, or because it was about to fail anyway and the character noticed it (this is the character’s decision).",
    "activation": "Action",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  10 }] }
  },
  {
    "id": 8,
    "name": "Balance",
    "description": "When the character recover from strain at the end of each encounter, he may roll his Force rating in Force dice. He regains additional strain equal to the number of white circles gained from the Force Die (White die).",
    "activation": "Maneuver",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  20 }] }
  },
  {
    "id": 9,
    "name": "Basic Combat Training",
    "description": "Brawl and Ranged (Light) become career skills.",
    "activation": "Passive",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  19 }] }
  },
  {
    "id": 10,
    "name": "Blooded",
    "description": "Add a Bonus Die (Blue Die) per rank of Blooded to all check to resist or recover from the effects of poisons, venoms, and other toxins. Reduce the duration of any related ongoing effects or damage from toxins, venoms, or poisons by one round per rank of Blooded to a minimum of one.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  13 }] }
  },
  {
    "id": 11,
    "name": "Body Guard",
    "description": "Once per round on the character’s turn, the character may perform a Body Guard maneuver to protect one ally he is engaged with. He then suffers a number of strain no greater than his ranks in Body Guard. Until the start of the character’s next turn, upgrade the difficulty if all combat checks targeting the protected ally a number of times equal to the strain suffered by the character.",
    "activation": "Maneuver",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  6 }] }
  },
  {
    "id": 12,
    "name": "Bought Info",
    "description": "When required to make a Knowledge skill check, the character can instead make a Bought Info action. He spends a number of credits equal to 50 times the difficulty of the check and counts as succeeding on the sheck with one uncancelled Success. At the GM's discretion, the character may not be able to use this ability if the information sought is particularly hard to find, or if the character is in a situation where he could not purchase information (such as marooned on a planet with no access to the HoloNet).",
    "activation": "Action",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  9 }] }
  },
  {
    "id": 13,
    "name": "Brace",
    "description": "As a maneuver, the character may Brace himself. This allows a character to remove a Setback Die (Black Die) per rank of Brace from the next skill check based on changing conditions: inclement weather, unstable surfaces, zero gravity, heavy gravity, or other disruptive physical obstacles that would make a skill check more difficult.",
    "activation": "Maneuver",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  2 }, { "id":  15 }] }
  },
  {
    "id": 14,
    "name": "Brilliant Evasion",
    "description": "The character may make the Brilliant Evasion action when piloting a vehicle or starship. The character selects one opponent and makes an Opposed Piloting (Planetary or Space) check. If he succeeds, the opponent’s vehicle or starship cannot make any attacks against the character’s vehicle for a number of rounds equal to the character’s Agility. Brilliant Evasion can only be performed once per encounter.",
    "activation": "Action",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  3 }, { "id":  5 }] }
  },
  {
    "id": 15,
    "name": "Bypass Security",
    "description": "Remove Setback Dice (Black Dice) eqal to the character’s ranks in Bypass Security from Skulduggery or Computers skill checks made to disable a security device or open a locked door.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  18 }] }
  },
  {
    "id": 16,
    "name": "Careful Planning",
    "description": "Once per game session, the character can choose to introduce a “fact” or additional context directing into the narrative as if he had spent a Destiny Point.",
    "activation": "Action",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  12 }] }
  },
  {
    "id": 17,
    "name": "Clever Solution",
    "description": "Once per game session, the character can choose to make one skill check using Cunning, rather than the characteristic linked to that skill. When he does this, he must explain how, in this particular instance, his cunning is helping him overcome this challenge.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  16 }] }
  },
  {
    "id": 18,
    "name": "Codebreaker",
    "description": "The character removes Setback Dice (Black Dice) from any attempt to break codes or decrypt communications equal to his ranks in Codebreaker. In addition, the character decreases the difficulty of Computers or Intellect checks made to break codes or decrypt communications by one. This does not increase with additional racks of Codebreaker.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  18 }] }
  },
  {
    "id": 19,
    "name": "Command",
    "description": "Gain a Bonus Die (Blue Die) when making Leadership checks for other checks to inspire, lead, or rally an audience per rank of Command. Inspired targets also add a Blue Die per rank to the subsequent Discipline checks they make over the twenty-four hours. This does not increase with additional ranks of Command.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  4 }, { "id":  5 }] }
  },
  {
    "id": 20,
    "name": "Commanding Presence",
    "description": "The character removes a Setback die per rank of Commanding Presence from his Leadership and Cool checks.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  4 }, { "id":  6 }] }
  },
  {
    "id": 21,
    "name": "Confidence",
    "description": "The character may decrease the difficulty of any Discipline check to avoid the effects of fear by one level per rank of Confidence. If he decreases the difficulty to zero, he does not have to make a Discipline check.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  7 }, { "id":  5 }, { "id":  6 }] }
  },
  {
    "id": 22,
    "name": "Contraption",
    "description": "Once per game session, the character can take a Contraption action. With a successful Hard Mechanics check, the character can fashion a device to solve a current problem using the tools and parts on hand. This device must be approved by the GM and functions for the duration of the current encounter only. Those tools are destroyed in the process. A Triumph may be spent to allow the tools to be reused later.",
    "activation": "Action",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  10 }] }
  },
  {
    "id": 23,
    "name": "Convincing Demeanor",
    "description": "Remove Setback Dice (Black Dice) per rank of Convincing Demeanor from any Deception or Skulduggery check.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  8 }] }
  },
  {
    "id": 24,
    "name": "Coordinated Assault",
    "description": "The character may make a Coordinated Assault maneuver. If he does so, a number of allies engaged with him equal to his ranks in Leadership gain Advantage on combat checks they make until the beginning of the character’s next turn. The range of this maneuver increases by one band per rank of Coordinated Assault.",
    "activation": "Maneuver",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  6 }] }
  },
  {
    "id": 25,
    "name": "Creative Killer",
    "description": "The character reduces the critical rating of all improvised weapons he is wielding by 2 (to a minimum of 1).",
    "activation": "Passive",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  19 }] }
  },
  {
    "id": 26,
    "name": "Crippling Blow",
    "description": "The character may voluntarily increase the difficulty of a combat check by one to deal a crippling blow. If he succeeds and deals damage to the target’s wound threshold, the target suffers one strain whenever he moves for the remainder of the encounter.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  15 }] }
  },
  {
    "id": 27,
    "name": "Dead to Rights",
    "description": "The character may spend one Destiny Point to add additional damage equal to half his Agility rating (rounded up) to one hit of a successful attack made by ship or vehicle-mounted weaponry.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  3 }] }
  },
  {
    "id": 28,
    "name": "Dead to Rights (Improved)",
    "description": "The character may spend one Destiny Point to add additional damage equal to his Agility rating to one hit of a successful attack made by ship or vehicle-mounted weaponry. This replaces the normal ability for Dead to Rights.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  3 }] }
  },
  {
    "id": 29,
    "name": "Deadly Accuracy",
    "description": "Each time the character gains a rank of Deadly Accuracy, he must choose one combat skill. The character may add his basic training ranks in that combat skill as additional damage to one hit of a successful attack made with that skill with non-starship/vehicle weapons. He cannot choose the same combat skill twice.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  15 }] }
  },
  {
    "id": 30,
    "name": "Debilitating Shot",
    "description": "Upon making a successful attack with a starship or vehicle weapon, may spend two Advantage to reduce the maximum speed of the target by 1 (to a minimum of 1) until the end of the next round. If the starship or vehicle was traveling its maximum speed, it has its current speed reduced to the new maximum.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  2 }] }
  },
  {
    "id": 31,
    "name": "Dedication",
    "description": "Each rank permanently increases a single characteristic of the player’s choice by one point. This cannot bring a characteristic above six.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [
      { "id":  1 },
      { "id":  2 },
      { "id":  3 },
      { "id":  4 },
      { "id":  5 },
      { "id":  6 },
      { "id":  7 },
      { "id":  8 },
      { "id":  9 },
      { "id":  10 },
      { "id":  11 },
      { "id":  12 },
      { "id":  13 },
      { "id":  14 },
      { "id":  15 },
      { "id":  16 },
      { "id":  17 },
      { "id":  18 },
      { "id":  19 },
      { "id":  20 }
    ]}
  },
  {
    "id": 32,
    "name": "Defensive Driving",
    "description": "Any vehicle the character pilots has its defense rating on all zones increased by one per rank of Defensive Driving.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [
      { "id":  1 },
      { "id":  3 },
      { "id":  5 }
    ]}
  },
  {
    "id": 33,
    "name": "Defensive Slicing",
    "description": "When attempting to defend a computer system against intrusion (or when an opponent attempts to slice a computer) the character adds Setback Dice (Black Dice) equal to his rank of Defensive Rating to his opponent’s checks.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  18 }] }
  },
  {
    "id": 34,
    "name": "Defensive Slicing (Improved)",
    "description": "When attempting to defend a computer system against intrusion, the character upgrades the difficulty of an opponent’s dice pool a number of times equal to his rank of Defensive Slicing. This replaces the usual benefits from Defensive Slicing.",
    "activation": "Passive",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  18 }] }
  },
  {
    "id": 35,
    "name": "Defensive Stance",
    "description": "One per round on the character’s turn, the character may perform a Defensive Stance maneuver to assume a defensive stance against incoming melee attacks. He then suffers a number of strain no greater than his ranks in Defensive Stance. Until the start of the character’s next turn, upgrade the difficulty of all melee combat checks targeting the character a number of time equal to the strain suffered by the character in this way.",
    "activation": "Maneuver",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  16 }] }
  },
  {
    "id": 36,
    "name": "Disorient",
    "description": "After hitting with a combat check, the character may spend two Advantages to disorient his foe. Disoriented targets add a Setback Die (Black Die) to all skill checks. The target is disoriented for a number of round equal to the attacker’s ranks in Disorient.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  17 }] }
  },
  {
    "id": 37,
    "name": "Dodge",
    "description": "When targeted by a combat check (ranged or melee) the character may choose to immediately perform a Dodge incidental to suffer a number of strain, them upgrade the difficulty of the combat check by that number. The number of strain suffered cannot exceed his ranks in Dodge.",
    "activation": "OutOfTurn",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [
      { "id":  7 },
      { "id":  14 },
      { "id":  16 }
    ]}
  },
  {
    "id": 38,
    "name": "Durable",
    "description": "The character may reduce a Critical Injury result suffered by 10 per rank of Durable, to a minimum of one.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  13 }, { "id":  2 }] }
  },
  {
    "id": 39,
    "name": "Dynamic Fire",
    "description": "When making a ranged attack while engaged with an opponent, the character may suffer 2 Strain to reduce the ranged modifier added for being engaged by 1 for the attack. So, when firing a Ranged (Heavy) weapon, the character only increases the difficulty by 1 when engaged, and when firing a Ranged (Light) weapon, he doesn’t increase the difficulty at all.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  19 }] }
  },
  {
    "id": 40,
    "name": "Enduring",
    "description": "Character gains +1 soak value per rank of Enduring.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [
      { "id":  2 },
      { "id":  10 },
      { "id":  19 }
    ]}
  },
  {
    "id": 41,
    "name": "Exhaust Port",
    "description": "Before attacking a starship or vehicle, the character may spend 1 Destiny Point to ignore the effects of the Massive rule for the attack.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  2 }] }
  },
  {
    "id": 42,
    "name": "Expert Tracker",
    "description": "Remove a Setback Die (Black Die) per rank of Expert tracker from check to find or follow tracks. Survival checks made to track targets take 50% less time than normal. This does not decrease with additional ranks of Expert Tracker.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  15 }] }
  },
  {
    "id": 43,
    "name": "Familiar Suns",
    "description": "Once per game session the character may spend a maneuver to make a Hard Knowledge (Outer Rim) or Knowledge (Core Worlds) check. If successful, the character is familiar with the type of planetary environment he finds himself in. He knows wheter the planet is likely to be inhabited and, if so, where habitation could be found. He also knows about unusual environmental effects, hostile predators, or sources of potential profit.",
    "activation": "Maneuver",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  4 }, { "id":  17 }] }
  },
  {
    "id": 44,
    "name": "Feral Strength",
    "description": "The character deals +1 damage to one hit on all successful Brawl and Melee checks per rank of Feral Strength.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  13 }] }
  },
  {
    "id": 45,
    "name": "Field Commander",
    "description": "The character may take a Field Commander action. By successfully passing an Average Leadership check, a number of allies equal to his Presence may immediately suffer one strain to perform one maneuver. This does not count against the number of maneuvers they may perform in their turn. If there are any questions as to the order in which the allies act, the character using Field Commander is the final arbitrator.",
    "activation": "Action",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  5 }, { "id":  6 }] }
  },
  {
    "id": 46,
    "name": "Field Commander (Improved)",
    "description": "When taking a Field Commander action, the cahracter may affect allies equal to twice his Presence. In addition, he may spend a Triumph generated on his Leadership checks to allow only one ally to suffer one strain to perform an action, rather than a maneuver.",
    "activation": "Passive",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  5 }, { "id":  6 }] }
  },
  {
    "id": 47,
    "name": "Fine Tuning",
    "description": "Whenever a character reduces the amount of strain a starship or vehicle suffers, he reduces one additional strain per rank of Fine Tuning.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  1 }, { "id":  10 }] }
  },
  {
    "id": 48,
    "name": "Fire Control",
    "description": "When in a starship or vehicle, the character can make a Fire Control maneuver. If he does so, all combat checks from the starship or vehicle count the silhouette of the target as one higher than normal until the beginning of the character’s next turn. This effect does not stack with multiple uses of the Fire Control maneuver.",
    "activation": "Maneuver",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  4 }] }
  },
  {
    "id": 49,
    "name": "Forager",
    "description": "Remove up to two Setback Dice (Black Dice) from skill checks to find food, water, or shelter. Survival checks to forage take half the time.",
    "activation": "Passive",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  14 }, { "id":  17 }] }
  },
  {
    "id": 50,
    "name": "Force of Will",
    "description": "Once per game session, the character can choose to make one skill check using Willpower, rather than the characteristic linked to that skill. When he does this, he must explain how, in this particular instance, his willpower is helping him overcome this challenge.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  20 }] }
  },
  {
    "id": 51,
    "name": "Force Rating",
    "description": "Each rank permanently increases Force rating by one.",
    "activation": "Passive",
    "ranked": true,
    "force": true,
    "specializations": { "connect": [{ "id":  20 }] }
  },
  {
    "id": 52,
    "name": "Form on Me",
    "description": "When the character performs that Gain the Advantage action, a number of allied vehicles equal to his ranks in Leadership and within Close Range also gain the benefits of the action on the target. These allied vehicles maintain the benefits until they leave close range with the character or the character loses the benefits of Gain the Advantage.",
    "activation": "Passive",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  5 }] }
  },
  {
    "id": 53,
    "name": "Frenzied Attack",
    "description": "When making a Melee or Brawl combat check, the character may suffer a number of strain, then upgrade the ability of his combat check by that number. The number cannot exceed his ranks in Frenzied Attack.",
    "activation": "Incidental",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  16 }] }
  },
  {
    "id": 54,
    "name": "Full Stop",
    "description": "When piloting a ship or vehicle, the character may take the Full Stop maneuver to immediately reduce the speed of the ship or vehicle to zero. The ship or vehicle then suffers one point of system strain for every point of speed it had before stopping.",
    "activation": "Maneuver",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  1 }, { "id":  5 }] }
  },
  {
    "id": 55,
    "name": "Full Throttle",
    "description": "The character may push a starship or vehicle past its limits of speed. He may perform the Full Throttle action, attempting a Hard Piloting check. With success, the ship’s top speed increases by one for a number of rounds equal to Cunning. The ship still cannot perform actions or maneuvers it could not perform normally (i.e. actions that have a minimum speed requirements)",
    "activation": "Action",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  1 }, { "id":  3 }] }
  },
  {
    "id": 56,
    "name": "Full Throttle (Improved)",
    "description": "The character may voluntarily suffer one strain to attempt Full Throttle as a maneuver. In addition, the difficulty of Full Throttle is reduce to Average Difficulty.",
    "activation": "Maneuver",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  1 }, { "id":  3 }] }
  },
  {
    "id": 57,
    "name": "Full Throttle (Supreme)",
    "description": "When the pilot successfully performs a Full Throttle, the ship’s top speed increases by two for a number of rounds equal to his Cunning, instead of one.",
    "activation": "Passive",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  1 }, { "id":  3 }] }
  },
  {
    "id": 58,
    "name": "Galaxy Mapper",
    "description": "Remover a Setback Die (Black Die) per rank of Galaxy Mapper from all Astrogation checks. In addition, Astrogation checks take 50% less time. This does not increase with multiple ranks of Galaxy Mapper.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  4 }, { "id":  3 }] }
  },
  {
    "id": 59,
    "name": "Gearhead",
    "description": "Remove a Setback Die (Black Die) per rank of Gearhead from all Mechanics checks. In addition, the credit cost to add mods to attachments decreases by 50%. This does not increase with multiple ranks of Gearhead.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  1 }, { "id":  10 }] }
  },
  {
    "id": 60,
    "name": "Greased Palms",
    "description": "Before making a social interaction check, the character may perform a Greased Palms maneuver and spend up to 50 credits per rank of Greased Palms. For every 50 credits spent, the character upgrades the ability of the skill check once. How the money accomplishes this can be up to the player and the GM, but could take the form of bribes, buying gifts, or even purchasing information that gives the character an advantage in the ensuing interaction.",
    "activation": "Maneuver",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  9 }] }
  },
  {
    "id": 61,
    "name": "Grit",
    "description": "Each rank of Grit increases a character’s strain threshold by one.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [
      { "id":  8 },
      { "id":  7 },
      { "id":  13 },
      { "id":  4 },
      { "id":  1 },
      { "id":  20 },
      { "id":  2 },
      { "id":  16 },
      { "id":  10 },
      { "id":  14 },
      { "id":  3 },
      { "id":  9 },
      { "id":  19 },
      { "id":  11 },
      { "id":  17 },
      { "id":  15 },
      { "id":  18 },
      { "id":  5 }
    ]}
  },
  {
    "id": 62,
    "name": "Hard Headed",
    "description": "The character may perform the Hard Headed action. On any turn in which the character is staggered or disoriented, he may perform the Hard Headed action (this action may be specifically performed even though he is normally barred from performing actions when staggered). He makes a Daunting (4 Difficulty Dice) Discipline check. If he succeeds, he is no longer staggered or disoriented. The difficulty of this check decreases by one per additional rank of Hard Headed, to a minimum of Easy.",
    "activation": "Action",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  10 }, { "id":  11 }] }
  },
  {
    "id": 63,
    "name": "Hard Headed (Improved)",
    "description": "The character may use his Hard Headed action to recover from being incapacitated due to exceeding his strain threshold, he may make a Formidable (5 Difficulty Dice) Discipline check as his Hard Headed action (this action can be specifically be performed even though he is normally barred from performing actions.) If he succeeds, decrease his strain to one below his strain threshold. The difficulty of this check decreases by one per rank of Hard Headed, to a minimum of Easy.",
    "activation": "Action",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  10 }, { "id":  11 }] }
  },
  {
    "id": 64,
    "name": "Heightened Awareness",
    "description": "Allies within close range of the character add a Bonus Die (Blue Die) to their Perception and Vigilance checks. Allies engaged with him add two Bonus Dice instead.",
    "activation": "Passive",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  17 }] }
  },
  {
    "id": 65,
    "name": "Heroic Fortitude",
    "description": "The character may spend one Destiny Point to ignore the effects of ongoing Critical Injuries on any Brawn or Agility related checks until the end of the encounter. He still suffers from the injury itself.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  13 }, { "id":  2 }] }
  },
  {
    "id": 66,
    "name": "Hidden Storage",
    "description": "Any large equipment, vehicle, or droid that the character owns has one or more hidden compartments for smuggling appropriately sized gear. The number of compartments is up to the player, but cannot be enough to old a total encumberance value of items more than the character’s ranks in Hidden Storage. The size of the compartments are proportional to the size of the vehicle or droid in question. Most humanoid droids can only hold items equivalent in size to a one-handed weapon, whereas a silhouette 4 starship could conceal humanoids within its compartments. Any checks to detect these compartments have a Formidable (5 Difficulty Dice) difficulty.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  12 }] }
  },
  {
    "id": 67,
    "name": "Hold Together",
    "description": "The character may spend one Destiny Point to make a Hold Together incidental immediately after a vehicle or starship he has repaired this encounter takes damage. The character explains why the apparently serious damage was in fact superficial, and the damage from the attack becomes system strain instead.",
    "activation": "OutOfTurn",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  4 }, { "id":  10 }] }
  },
  {
    "id": 68,
    "name": "Incite Rebellion",
    "description": "Once per game session, the character can take an Incite Rebellion action to make a Hard Coercion check. If successful, a number of beings up to his rank in Coercion become unhappy and try to take action against an organization or authority with power over them until the end of the encounter. This could be due to something the character did or said, or just because the beings were already unhappy with their position.",
    "activation": "Action",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  8 }] }
  },
  {
    "id": 69,
    "name": "Indistinguishable",
    "description": "The character’s appearance is so common that people have a hard time identifying distinguishing traits. Opposing characters upgrade the difficulty of any checks made to identify him once per rank of Indistinguishable.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  7 }, { "id":  20 }] }
  },
  {
    "id": 70,
    "name": "Insight",
    "description": "Perception and Discipline become career skills if they were not already.",
    "activation": "Passive",
    "ranked": false,
    "force": true,
    "specializations": { "connect": [{ "id":  20 }] }
  },
  {
    "id": 71,
    "name": "Inspiring Rhetoric",
    "description": "The character may take the Inspiring Rhetoric action; making an Average Leadership check. For each Success, one ally within close range recovers one strain. For each Advantage, one ally benefiting from Inspiring Rhetoric recovers one additional strain.",
    "activation": "Action",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  7 }] }
  },
  {
    "id": 72,
    "name": "Inspiring Rhetoric (Improved)",
    "description": "Each ally affected by Inspiring Rhetoric gains a Bonus Die (Blue Die) on all skill checks for a number of rounds equal to the character’s ranks in Leadership; this does not stack with itself.",
    "activation": "Passive",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  7 }] }
  },
  {
    "id": 73,
    "name": "Inspiring Rhetoric (Supreme)",
    "description": "The character may voluntarily suffer one strain to perform Inspiring Rhetoric as a maneuver instead of an action.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  7 }] }
  },
  {
    "id": 74,
    "name": "Intense Focus",
    "description": "Before making a skill check, the character may perform the Intense Focus maneuver. The character suffers one strain to upgrade the ability of the skill check once.",
    "activation": "Maneuver",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  9 }, { "id":  12 }] }
  },
  {
    "id": 75,
    "name": "Intense Presence",
    "description": "The character may spend one Destiny Point to recover strain equal to his Presence rating.",
    "activation": "OutOfTurn",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  7 }] }
  },
  {
    "id": 76,
    "name": "Intimidating",
    "description": "When attempting a Coercion check, the character may suffer a number of strain to downgrade the difficulty of the check a number of times equal to the strain suffered. This number cannot exceed his ranks in Intimidating. When the character is the target of a Coercion check, the character may suffer a number of strain to upgrade the difficulty of the check a number of time equal to the strain suffered. This number cannot exceed his ranks in Intimidating.",
    "activation": "OutOfTurn",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  8 }] }
  },
  {
    "id": 77,
    "name": "Inventor",
    "description": "When constructing new items or modifying existing attachments, the character may choose to add a Bonus Die (Blue Die) or remove a Setback Die (Black Die) from the check per rank of Inventor.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  12 }] }
  },
  {
    "id": 78,
    "name": "Invigorate",
    "description": "Once per encounter, when an ally within short range attempts a skill check using the Brawn or Agility characteristic, the character may roll a Force die. Each white dot adds a Success whilst each black dot adds a threat to the target’s check.",
    "activation": "OutOfTurn",
    "ranked": false,
    "force": true,
    "specializations": { "connect": [{ "id":  20 }] }
  },
  {
    "id": 79,
    "name": "It's Not That Bad",
    "description": "Once per game session, when an ally is about to suffer a critical injury, the character can take an It’s Not That Bad incidental to make a Hard Medicine check. If successful, the ally does not gain the Critical Injury and does not suffer any of its normal effects (although the attack that caused the Critical Injury still deals its damage as normal).",
    "activation": "OutOfTurn",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  14 }] }
  },
  {
    "id": 80,
    "name": "Jump Up",
    "description": "Once per round on the character’s turn, the character may stand up from prone or a seated position as an Incidental.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  16 }, { "id":  19 }] }
  },
  {
    "id": 81,
    "name": "Jury Rigged",
    "description": "The character chooses one personal weapon or piece of armor per rank of Jury Rigged. He may increase the damage of the weapon by one; decrease the Advantage cost on its Critical, or any single other effect by one to a minimum of one; or increase armor’s ranged or melee defense by one. Alternatively, he can decrease the encumbrance of the item by two to a minimum of one. The bonus only applies so long as the character using the item. If the item is ever lost, or destroyed, the character may apply Jury Rigged to a new personal weapon or piece of armor.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  2 }] }
  },
  {
    "id": 82,
    "name": "Kill with Kindness",
    "description": "Remove a Setback Die (Black Die) per rank of Kill with Kindness from all Charm and Leadership checks the character attempts.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  7 }] }
  },
  {
    "id": 83,
    "name": "Knockdown",
    "description": "After hitting with a melee attack, the character may knock the target prone by spending a Triumph. If the target is larger than the acting character, it requires an additional Triumph for each silhouette larger.",
    "activation": "Passive",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  13 }, { "id":  16 }] }
  },
  {
    "id": 84,
    "name": "Know Somebody",
    "description": "Once per game session, when attempting to purchase a legally available item, the character may reduce its rarity by one step per rank of Know Somebody.",
    "activation": "Incidental",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  9 }] }
  },
  {
    "id": 85,
    "name": "Knowledge Specialization",
    "description": "When the character first acquires this talent, he may choose one Knowledge skill. When making checks with that skill, he may spend a Triumph to gain additional successes equal to his ranks in Knowledge Specialization.",
    "activation": "Incidental",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  12 }] }
  },
  {
    "id": 86,
    "name": "Known Schematics",
    "description": "Once per game session, the character may spend a maneuver to make a Hard Knowledge (Education) check. Success means the character is familiar with a building or capital ship’s design. He now knows the location of critical components or facilities within the ship or vehicle, as well as his own location. He can also plan unconventional routes around onstacles. Additional Successes, Advantages, or Triumphs results can reveal other useful information at the GMs discretion.",
    "activation": "Maneuver",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  4 }] }
  },
  {
    "id": 87,
    "name": "Let's Ride",
    "description": "Once per round on the character’s turn, the character may mount or dismount from a vehicle or beast, or slide into the cockpit or weapon station aboard a starship, as an incidental instead of a maneuver.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [
      { "id":  3 },
      { "id":  17 },
      { "id":  5 }
    ]}
  },
  {
    "id": 88,
    "name": "Lethal Blows",
    "description": "The character adds +10 per rank of Lethal Blows to any Critical Injury rolls inflicted on opponents.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  15 }] }
  },
  {
    "id": 89,
    "name": "Master Doctor",
    "description": "Once per round, the character may suffer two strain to decrease the difficulty of his next Medicine check by one to a minimum of an Easy difficulty.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  14 }] }
  },
  {
    "id": 90,
    "name": "Master Driver",
    "description": "Once per round when piloting a vehicle using the Piloting (Planetary) skill, the character may voluntarily suffer two strain to perform any action as maneuver instead.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  1 }] }
  },
  {
    "id": 91,
    "name": "Master Grenadier",
    "description": "The character decreases the Advantage cost to active the Blast quality on any weapon he uses by 1 to a minimum of 1. This includes the cost to activate the Blast quality if the weapon misses.",
    "activation": "Passive",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  11 }] }
  },
  {
    "id": 92,
    "name": "Master Leader",
    "description": "Once per round, the character may suffer two strain to decrease the difficulty of his next Leadership check by one, to a minimum of an Easy difficulty.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  5 }] }
  },
  {
    "id": 93,
    "name": "Master Merchant",
    "description": "Before making a check when buying or selling items, or undertaking or paying off Obligation, the character may choose to suffer two strain. If the check succeeds, he sells the item for 25% more than base cost, buys it for 25% less, pays off an additional one Obligation point, or undertakes one less Obligation point.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  9 }] }
  },
  {
    "id": 94,
    "name": "Master of Shadows",
    "description": "Once per round, the character may voluntarily suffer two strain to decrease the difficulty of the next Stealth or Skulduggery check by one, to a minimum of Easy.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  16 }] }
  },
  {
    "id": 95,
    "name": "Master Pilot",
    "description": "Once per round when piloting a starship (a ship piloted using the Piloting (Space) skill), the character may voluntarily suffer two strain to perform any action as a maneuver instead.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  3 }] }
  },
  {
    "id": 96,
    "name": "Master Slicer",
    "description": "Once per round, the character may perform a Master Slicer incidental to suffer two strain and decrease the difficulty of the next Computers or other slicing-related check by one, to a minimum of Easy.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  18 }] }
  },
  {
    "id": 97,
    "name": "Master Starhopper",
    "description": "Once per round, the character may suffer two strain to decrease the difficulty of his next Astrogation check by one, to a minimum of Easy.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  4 }] }
  },
  {
    "id": 98,
    "name": "Mental Fortress",
    "description": "The character may spend one Destiny Point to ignore the effects of ongoing Critical Injuries on any Intellect or Cunning related checks until the end of the encounter. He still suffers from the injury itself.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  12 }, { "id":  18 }] }
  },
  {
    "id": 99,
    "name": "Natural Brawler",
    "description": "Once per game session, the character may reroll any one Brawl or Melee check.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  16 }] }
  },
  {
    "id": 100,
    "name": "Natural Charmer",
    "description": "Once per game session, the character may reroll any one Charm or Deception check.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  7 }] }
  },
  {
    "id": 101,
    "name": "Natural Doctor",
    "description": "Once per game session, the character may reroll any one Medicine check.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  14 }] }
  },
  {
    "id": 102,
    "name": "Natural Driver",
    "description": "Once per game session, the character may reroll any one Piloting (Planetary) or Gunnery check.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  1 }] }
  },
  {
    "id": 103,
    "name": "Natural Enforcer",
    "description": "Once per game session, the character may reroll any one Coercion or Streetwise check.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  8 }] }
  },
  {
    "id": 104,
    "name": "Natural Hunter",
    "description": "Once per game session, the character may reroll any one Perception or Vigilance check.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  17 }] }
  },
  {
    "id": 105,
    "name": "Natural Leader",
    "description": "Once per game session, the character may reroll any one Cool or Leadership check.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  6 }] }
  },
  {
    "id": 106,
    "name": "Natural Marksman",
    "description": "Once per game session, the character may reroll any one Ranged (Light) or Ranged (Heavy) check.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  15 }] }
  },
  {
    "id": 107,
    "name": "Natural Negotiator",
    "description": "Once per game session, the character can reroll any one Cool or Negotiation check.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  9 }] }
  },
  {
    "id": 108,
    "name": "Natural Outdoorsman",
    "description": "Once per game session, the character may reroll any one Resilience or Survival check.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  13 }, { "id":  6 }] }
  },
  {
    "id": 109,
    "name": "Natural Pilot",
    "description": "Once per game session, the character may reroll any one Piloting (Space) or Gunnery check.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  3 }] }
  },
  {
    "id": 110,
    "name": "Natural Programmer",
    "description": "Once per game session, the character may reroll any one Computer or Astrogation check.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  18 }] }
  },
  {
    "id": 111,
    "name": "Natural Rogue",
    "description": "Once per game session, the character may reroll any one Skulduggery or Stealth check.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  16 }] }
  },
  {
    "id": 112,
    "name": "Natural Scholar",
    "description": "Once per game session, the character may reroll any one Knowledge check.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  12 }] }
  },
  {
    "id": 113,
    "name": "Natural Tinkerer",
    "description": "Once per game session, the character may reroll any one Mechanics check.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  10 }] }
  },
  {
    "id": 114,
    "name": "Nobody's Fool",
    "description": "The difficulty of any Charm, Coercion or Deception checks attempted against the character is upgraded once for each rank of Nobody’s Fool.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  7 }, { "id":  8 }] }
  },
  {
    "id": 115,
    "name": "Outdoorsman",
    "description": "The character removes a Setback Die (Black Die) per rank of Outdoorsman from checks to move through terrain or manage terrain or environmental effects. Decrease overland travel times by 50% (this does not decrease with multiple ranks of Outdoorsman).",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  19 }, { "id":  6 }] }
  },
  {
    "id": 116,
    "name": "Overwhelm Defenses",
    "description": "Upon making an unsuccessful attack with a starship or vehicle weapon, the character may spend two Advantage per rank of Overwhelm Defenses to reduce the defense rating in the defense zone targeted by the check by one for every two Advantage spent.",
    "activation": "Incidental",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  2 }] }
  },
  {
    "id": 117,
    "name": "Physical Training",
    "description": "This character add a Bonus Die per rank of Physical Training to his Athletics and Resilience checks.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  13 }] }
  },
  {
    "id": 118,
    "name": "Plausible Deniability",
    "description": "Remove a Setback Die (Black Die) per rank of Plausible Deniability from all Coercion and Deception checks the character attempts.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  8 }] }
  },
  {
    "id": 119,
    "name": "Point Blank",
    "description": "The character adds one damage per rank of Point Blank to one hit of successful Ranged (Heavy) or Ranged (Light) attacks made while at short range or engaged.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  13 }] }
  },
  {
    "id": 120,
    "name": "Powerful Blast",
    "description": "The character increases the Blast quality damage dealt by explosives, explosive weapons, and grenades he uses by 1 per rank of Powerful Blast.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  11 }] }
  },
  {
    "id": 121,
    "name": "Quick Draw",
    "description": "Once per round on the character’s turn, he may draw or holster an easily accessible weapon as an incidental, not a maneuver. This talent also reduces the amount of time to draw or stow a weapon that usually requires more than one maneuver to properly prepare or stow, by one maneuver.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  19 }, { "id":  6 }] }
  },
  {
    "id": 122,
    "name": "Quick Fix",
    "description": "Once per game session, the character can choose to make one skill check using Agility, rather than the characteristic linked to that skill. When he does this, he must explain how, in this particular instance, his Agility is helping him overcome this challenge.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  15 }] }
  },
  {
    "id": 123,
    "name": "Quick Strike",
    "description": "When performing a combat check during combat, the character adds a Bonus Die (Blue Die) per rank of Quick Strike to combat checks against any target that has not yet acted in the encounter.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  17 }, { "id":  5 }] }
  },
  {
    "id": 124,
    "name": "Rapid Reaction",
    "description": "The character may suffer a number of strain to add an equal number of Successes to any Vigilance or Cool check to determine initiative order. The number may not exceed his ranks in Rapid Reaction.",
    "activation": "OutOfTurn",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  1 }, { "id":  4 }] }
  },
  {
    "id": 125,
    "name": "Rapid Recovery",
    "description": "When this character heals strain after an encounter has concluded, he heals one additional strain per rank in Rapid Recovery.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [
      { "id":  3 },
      { "id":  11 },
      { "id":  17 }
    ]}
  },
  {
    "id": 126,
    "name": "Redundant Systems",
    "description": "With an Easy Mechanics Check, the character may harvest components from a functioning device to repair a broken one, without breaking the functioning device. This allows the character to repair a broken device without having required spare parts, raw materials, or repair kits (the initial check does not suffer penalties for lacking repair kits, either). This only works, however, if the functioning device is at least the same size and technological level as the device being repaired (it is impossible to repair a starship with a blaster pistol, or a lightsaber with parts from a water wheel).",
    "activation": "Action",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  10 }] }
  },
  {
    "id": 127,
    "name": "Researcher",
    "description": "The character removes a Setback Die (Black Die) per rank of Researcher from all Knowledge checks. Researching takes 50% less time (this does not increase with multiple ranks of researcher).",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  12 }] }
  },
  {
    "id": 128,
    "name": "Resolve",
    "description": "When the character suffers strain, he suffers one less strain per rank of Resolve, to a minimum of one. This does no apply to voluntary strain loss.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  11 }, { "id":  18 }] }
  },
  {
    "id": 129,
    "name": "Respected Scholar",
    "description": "The character downgrades the difficulty of checks to interact with institutions of learning by one per rank of Respected Scholar.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  12 }] }
  },
  {
    "id": 130,
    "name": "Scathing Tirade",
    "description": "The character may take the Scathing Tirade action by making an Average Coercion check. For each Success, one enemy within Short range suffers one strain. The character can also spend Advantage, and for every Advantage spent, one target already affected suffers one additional strain.",
    "activation": "Action",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  8 }] }
  },
  {
    "id": 131,
    "name": "Scathing Tirade (Improved)",
    "description": "Each enemy affected by Scathing Tirade suffers a Setback die on all skill ranks for a number of rounds equal to the character’s ranks in Coercion; this doesn’t stack with itself.",
    "activation": "Passive",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  8 }] }
  },
  {
    "id": 132,
    "name": "Scathing Tirade (Supreme)",
    "description": "The character may voluntarily suffer one strain to perform Scathing Tirade as a maneuver instead of an action.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  8 }] }
  },
  {
    "id": 133,
    "name": "Second Wind",
    "description": "Once per encounter, the character may use a Second Wind incidental to recover an amount of strain equal to his ranks in Second Wind.",
    "activation": "Incidental",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  19 }, { "id":  11 }] }
  },
  {
    "id": 134,
    "name": "Selective Detonation",
    "description": "When using weapons with the Blast quality or explosive devices, the character may spend Advantage to exclude one target that would normally be affected by the explosion. Multiple targets may be excluded in this manner, but the total number may not exceed his ranks in Selective Detonation. The character may also spend Triumph’s to exclude multiple targets, as long as the total number of targets excluded does not exceed his ranks in Selective Detonation.",
    "activation": "Incidental",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  11 }] }
  },
  {
    "id": 135,
    "name": "Sense Danger",
    "description": "Once per game session, the character may remove two Setback Dice from any one skill check.",
    "activation": "Incidental",
    "ranked": false,
    "force": true,
    "specializations": { "connect": [{ "id":  20 }] }
  },
  {
    "id": 136,
    "name": "Shortcut",
    "description": "During a chase, the character adds a Bonus die per rank of Shortcut to his checks made to catch or escape an opponent.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  17 }] }
  },
  {
    "id": 137,
    "name": "Side Step",
    "description": "Once per round on the character’s turn, the character may perform a Side Step maneuver to try to avoid incoming ranged attacks. He then suffers a number of strain no greater than his ranks in Side Step. Until the start of the character’s next turn, upgrade the difficulty of all ranged combat checks targeting the character a number of times equal to the strain suffered by the character.",
    "activation": "Maneuver",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  6 }] }
  },
  {
    "id": 138,
    "name": "Situational Awareness",
    "description": "When in a starship or vehicle with functional comms, allies within short range add a Bonus die to their Perception and Vigilance checks. Allies within Close Range add two Bonus Dice instead. This talent operates on Planetary scale, not personal scale.",
    "activation": "Passive",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  5 }] }
  },
  {
    "id": 139,
    "name": "Sixth Sense",
    "description": "The character gain +1 to ranged defense.",
    "activation": "Passive",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  7 }] }
  },
  {
    "id": 140,
    "name": "Skilled Jockey",
    "description": "The character removes a Setback die per rank of Skilled Jockey from his Piloting (Planetary) and Piloting (Space) checks.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  1 }, { "id":  3 }] }
  },
  {
    "id": 141,
    "name": "Skilled Slicer",
    "description": "When making a Computers check, the character may spend a Triumph to gain some measure of control over the target system. Any further Computers checks within this system can be made as maneuvers.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  18 }] }
  },
  {
    "id": 142,
    "name": "Sleight of Mind",
    "description": "The character adds a Bonus die per rank of Sleight of Mind to his Stealth checks unless the being attempting to detect the character is immune to Force Powers.",
    "activation": "Passive",
    "ranked": true,
    "force": true,
    "specializations": { "connect": [{ "id":  20 }] }
  },
  {
    "id": 143,
    "name": "Smooth Talker",
    "description": "When a character first acquires this talent, he chooses one skill: Charm, Coercion, Negotiation or Deception. When making skill checks with that skill, he may spend a Triumph to get a number of Successes equal to his ranks in Smooth Talker.",
    "activation": "Incidental",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  9 }] }
  },
  {
    "id": 144,
    "name": "Sniper Shot",
    "description": "Once per round before making a non-thrown ranged attack, the character may perform a maneuver to attempt a Sniper Shot. Sniper Shot increases the maximum range of his ranged weapon up to one range band per rank. For each rank beyond the normal maximum of the weapon, upgrade the difficulty of the check by one (this is in addition to the increased difficulty of the shot due to longer range).",
    "activation": "Maneuver",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  15 }] }
  },
  {
    "id": 145,
    "name": "Soft Spot",
    "description": "After making a successful attack with a non-starship/vehicle weapon, the character may spend one Destiny Point to add damage equal to his Cunning to one hit of the successful attack.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  16 }] }
  },
  {
    "id": 146,
    "name": "Solid Repairs",
    "description": "Whenever the character repairs hull trauma on a starship or vehicle, he repairs one additional hull trauma per rank of Solid Repairs.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  4 }, { "id":  10 }] }
  },
  {
    "id": 147,
    "name": "Sound Investments",
    "description": "At the beginning of each game session, the character gains credits equal to his ranks in Sound Investments time 100. How this money is earned is up to the player and GM, and could be actual investments, business dealings, or even a small legal/illegal side business. The GM can also decide that the current events of the adventure may make these funds temporarily unavailable.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  9 }] }
  },
  {
    "id": 148,
    "name": "Spare Clip",
    "description": "The character does not run out of ammo on a Despair. Items with Limited Ammo quality run out of ammo as normal.",
    "activation": "Passive",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  2 }, { "id":  19 }] }
  },
  {
    "id": 149,
    "name": "Speaks Binary",
    "description": "The character gains a Bonus die per rank of Speaks Binary to any tasks he directs Non-Player Character droids to perform.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  12 }] }
  },
  {
    "id": 150,
    "name": "Stalker",
    "description": "The character adds a Bonus die per rank of Stalker to his Coordination and Stealth checks.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  17 }] }
  },
  {
    "id": 151,
    "name": "Steely Nerves",
    "description": "The character may spend one Destiny Point to ignore the effects of ongoing Critical Injuries on any Presence or Willpower related checks until the end of the encounter. He still suffers from the injury itself.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  7 }] }
  },
  {
    "id": 152,
    "name": "Stim Application",
    "description": "The character may take the Stim Application action. To perform this action, he must have access to drugs. a medpac, or stimpacks. He makes an Average Medicine check. If successful, one ally he is engaged with (including himself) increases one characteristic of the character’s choice by one for the remainder of the encounter, and suffers four strain. A single character’s individual characteristics may each only be increased once by Stim Application during an encounter.",
    "activation": "Action",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  14 }] }
  },
  {
    "id": 153,
    "name": "Stim Application (Improved)",
    "description": "As an incidental, when performing a Stim Application action, the character may increase the difficulty of the Medicine check to Hard. If he does so, the target of the action suffers one point of strain instead of four.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  14 }] }
  },
  {
    "id": 154,
    "name": "Stim Application (Supreme)",
    "description": "When performing the Stim Application action, each Triumph may be spent to increase an additional characteristic by one.",
    "activation": "Passive",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  14 }] }
  },
  {
    "id": 155,
    "name": "Stimpack Specialization",
    "description": "Whenever the character uses a stimpack, the target equal an additional wound per rank of Stimpack Specialization. The sixth stimpack and beyond each day still have no effect.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  14 }] }
  },
  {
    "id": 156,
    "name": "Street Smarts",
    "description": "Remove a Setback Die (Black Die) per rank of Street Smarts from any Streetwise or Knowledge (Underworld) checks the character attempts.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  8 }] }
  },
  {
    "id": 157,
    "name": "Stroke of Genius",
    "description": "Once per game session, the character can choose to make one skill check using Intellect, rather than the characteristic linked to that skill. When he does this, he must explain how, in this particular instance, his intelligence is helping him overcome this challenge.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  12 }] }
  },
  {
    "id": 158,
    "name": "Strong Arm",
    "description": "Characters with the Strong Arm talent treat thrown weapons as if they had one step greater range, to a maximum of medium range.",
    "activation": "Passive",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  13 }] }
  },
  {
    "id": 159,
    "name": "Stunning Blow",
    "description": "When making Melee checks, the character may choose to deal damage as strain instead of wounds. This does not ignore soak.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  16 }] }
  },
  {
    "id": 160,
    "name": "Stunning Blow (Improved)",
    "description": "When dealing strain damage with Melee or Brawl checks, the character may spend a Triumph result to stagger his target for one round per Triumph.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  16 }] }
  },
  {
    "id": 161,
    "name": "Superior Reflexes",
    "description": "The character gains +1 melee defense.",
    "activation": "Passive",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  9 }] }
  },
  {
    "id": 162,
    "name": "Surgeon",
    "description": "When this character makes a Medicine check to help a character heal wounds, the target heals one additional wound per rank of Surgeon.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  14 }] }
  },
  {
    "id": 163,
    "name": "Swift",
    "description": "The character does not suffer the penalties for moving through difficult terrain (he moves through it at normal speed, without spending additional maneuvers)",
    "activation": "Passive",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  6 }] }
  },
  {
    "id": 164,
    "name": "Tactical Combat Training",
    "description": "Melee and Ranged (Heavy) become career skills.",
    "activation": "Passive",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  19 }] }
  },
  {
    "id": 165,
    "name": "Targeted Blow",
    "description": "On a successful attack during combat with a non-starship/vehicle weapon, the character may spend one Destiny Point to add damage equal to his Agility to one hit of the successful attack.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  15 }] }
  },
  {
    "id": 166,
    "name": "Technical Aptitude",
    "description": "For each rank, the character reduces the amount of time needed to complete Computer-related tasks by 25%.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  18 }] }
  },
  {
    "id": 167,
    "name": "Time to Go",
    "description": "The character may spend 1 Destiny Point to perform a Move maneuver as an incidental to attempt to move into cover or out of the blast range of a weapon or explosion. This may be performed out of turn. This incidental occurs after he character determines he would be hit by the blast, but before damage is applied.",
    "activation": "OutOfTurn",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  11 }] }
  },
  {
    "id": 168,
    "name": "Time to Go (Improved)",
    "description": "When activating Time to Go, the character may allow one ally he is engaged with to also perform an out of turn Move maneuver as an incidental to attempt to move into cover or out of the blast range of a weapon or explosion. This incidental occurs after the ally determines he would be hit by the blast, but before damage is applied.",
    "activation": "OutOfTurn",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  11 }] }
  },
  {
    "id": 169,
    "name": "Tinkerer",
    "description": "The character makes one piece of equipment more modifiable. He chooses one piece of equipment and increases its number of hard points by one. He can only do this once per piece of equipment, but can modify a number of pieces of equipment equal to his ranks in Tinkerer. If he loses a modified piece of equipment, he may apply Tinkerer to a new one.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  12 }] }
  },
  {
    "id": 170,
    "name": "Touch of Fate",
    "description": "Once per game session, the character may add two Bonus Dice (Blue Dice) to any one skill check.",
    "activation": "Incidental",
    "ranked": false,
    "force": true,
    "specializations": { "connect": [{ "id":  20 }] }
  },
  {
    "id": 171,
    "name": "Toughened",
    "description": "Once per game session, the character may add two Bonus Dice (Blue Dice) to any one skill check.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [
      { "id":  13 },
      { "id":  1 },
      { "id":  20 },
      { "id":  2 },
      { "id":  16 },
      { "id":  10 },
      { "id":  14 },
      { "id":  3 },
      { "id":  9 },
      { "id":  19 },
      { "id":  11 },
      { "id":  17 },
      { "id":  15 },
      { "id":  6 }
    ]}
  },
  {
    "id": 172,
    "name": "Tricky Target",
    "description": "Any vehicle the character pilots counts as having a silhouette of one lower than normal when being attacked, to a minimum of 0.",
    "activation": "Passive",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  1 }, { "id":  3 }, { "id":  5 }] }
  },
  {
    "id": 173,
    "name": "True Aim",
    "description": "Once per round, before the character makes a ranged attack, he may perform a True Aim maneuver. By performing this maneuver, the character gains all the benefits for aiming and also upgrades his attack roll once per rank of True Aim.",
    "activation": "Maneuver",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  2 }, { "id":  15 }] }
  },
  {
    "id": 174,
    "name": "Uncanny Reactions",
    "description": "The character adds a Bonus Die (Blue Die) per rank of Uncanny Reactions to all Vigilance checks.",
    "activation": "Passive",
    "ranked": true,
    "force": true,
    "specializations": { "connect": [{ "id":  20 }] }
  },
  {
    "id": 175,
    "name": "Uncanny Senses",
    "description": "The character adds a Bonus Die (Blue Die) per rank of Uncanny Senses to all Perception checks.",
    "activation": "Passive",
    "ranked": true,
    "force": true,
    "specializations": { "connect": [{ "id":  20 }] }
  },
  {
    "id": 176,
    "name": "Unstoppable",
    "description": "If the percentile roll made when the character receives a Critical Injury is 1, or is reduced to 1, the character does not receive the Critical Injury and suffers none of the effects.",
    "activation": "Passive",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  13 }] }
  },
  {
    "id": 177,
    "name": "Utility Belt",
    "description": "The character may spend one Destiny Point to perform a Utility Belt incidental to produce a previously undocumented – but essential – small tool from his utility belt, satchel, or pockets, with a rarity no greater than 4. This cannot be a weapon unless the weapon has the Limited Ammo 1 quality.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  12 }, { "id":  17 }] }
  },
  {
    "id": 178,
    "name": "Vehicle Combat Training",
    "description": "Gunnery and Piloting (Planetary) become career skills.",
    "activation": "Passive",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id": 19 }] }
  },
  {
    "id": 179,
    "name": "Well Rounded",
    "description": "The character chooses any two skills. They permanently become career skills.",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id": 14 }] }
  },
  {
    "id": 180,
    "name": "Well Traveled",
    "description": "Knowledge (Core Worlds) and Knowledge (Outer Rim) become career skills.",
    "activation": "Passive",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id": 19 }] }
  },
  {
    "id": 181,
    "name": "Wheel and Deal",
    "description": "When he sells legal goods to a reputable merchant or business, the character gains an additional 10% more credits per rank of Wheel and Deal (based on the original sell price of the good or item)",
    "activation": "Passive",
    "ranked": true,
    "force": false,
    "specializations": { "connect": [{ "id":  9 }] }
  },
  {
    "id": 182,
    "name": "Works Like a Charm",
    "description": "Once per game session, the character can choose to make one skill check using Presence, rather than the characteristic linked to that skill. When he does this, he must explain how, in this particular instance, his social ability is helping him overcome this challenge.",
    "activation": "Incidental",
    "ranked": false,
    "force": false,
    "specializations": { "connect": [{ "id":  7 }] }
  }
]
